// wbs 各标签页需要数据整理
{
    // wbs编码
    // 任务名称
    // parent id
    // type类型  project /task  /milestone
    // 专业
    // 任务说明
    // 工期
    // 开始日期
    // 结束日期
    // 工程量
    // 工程量单位
    // 工效
    // 工效单位
    // 前置任务
    // 是否是里程碑
    // 是否委外
    // 委外原因
    // 委外负责人角色
    // 委外负责人名单
    // 委外负责人名称
    // 合同事项
    // 承担人角色
    // 技能等级
    // 持续时间
    // 完成并提交日期
    // task_type 
    // 任务绩效 工程量
    // 任务绩效 工程量单位
    // 任务绩效 绩效
    // 任务绩效 小计
    // 机械（材料、人工；同） 名称
    // 机械（材料、人工；同） 型号
    // 机械（材料、人工；同） 耗用量
    // 机械（材料、人工；同） 单位
    // 机械（材料、人工；同） 单价
    // 机械（材料、人工；同） 小计
}